### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.io_platform_apim_api_itn.azapi_resource.session_manager_pool will be created
  + resource "azapi_resource" "session_manager_pool" {
      + body                      = {
          + properties = {
              + description = "Load Balancer of Session Manager"
              + pool        = {
                  + services = [
                      + {
                          + id = (known after apply)
                        },
                      + {
                          + id = (known after apply)
                        },
                    ]
                }
              + protocol    = null
              + type        = "Pool"
              + url         = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "session-manager-pool"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.ApiManagement/service/backends@2024-06-01-preview"
    }

  # module.io_platform_apim_api_itn.azurerm_api_management_backend.session_manager_backends[0] will be created
  + resource "azurerm_api_management_backend" "session_manager_backends" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + id                  = (known after apply)
      + name                = "session-manager-backend-1"
      + protocol            = "http"
      + resource_group_name = "io-p-itn-common-rg-01"
      + title               = "Session Manager 1"
      + url                 = "https://io-p-weu-session-manager-app-03.azurewebsites.net/"
    }

  # module.io_platform_apim_api_itn.azurerm_api_management_backend.session_manager_backends[1] will be created
  + resource "azurerm_api_management_backend" "session_manager_backends" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + id                  = (known after apply)
      + name                = "session-manager-backend-2"
      + protocol            = "http"
      + resource_group_name = "io-p-itn-common-rg-01"
      + title               = "Session Manager 2"
      + url                 = "https://io-p-weu-session-manager-app-04.azurewebsites.net/"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>
